# Connect to MySQL Server

After [installing SQL magic for Jupyter](Install-SQL-Magic.ipynb), you are ready to use SQL directly from a Jupyter notebook.

Make sure you know the database host name, the username, and the password.

To avoid exposing your credentials, let's store them in a file name `cred.json` in the current directly: 
* Go to the Jupyter `Home` tab
* From the "New" dropdown menu, select `Text File`.
* Rename the file to `cred.json`
* In the editor, type the following:

```
{
    "host": "database-host-address",
    "user": "your-user-name",
    "password": "your-secret-password"
}

```
* You can close the tab

Make sure no one else sees this file. Do not send it to anyone and do not check it in with your homework.

Now you can create your connection string in python:

In [1]:
import json
with open('cred.json') as f:
    creds = json.load(f)

In [2]:
connection_string = "mysql://{user}:{password}@{host}".format(**creds)

Now import the mysql client library and make it available to the SQL magic:

In [3]:
import pymysql 
pymysql.install_as_MySQLdb()

Now enable the SQL magic:

In [4]:
%load_ext sql
%config SqlMagic.autocommit=True

and connect to the server:

In [5]:
%sql $connection_string

'Connected: dimitri@None'

You are done! You can now write and execute SQL queries in cells that start with `%%sql`:

In [6]:
%%sql

use shared_uni;

show tables;

 * mysql://dimitri:***@db.data-science-ust.net
0 rows affected.
11 rows affected.

[('~log',),
 ('course',),
 ('current_term',),
 ('department',),
 ('enroll',),
 ('grade',),
 ('letter_grade',),
 ('section',),
 ('student',),
 ('student_major',),
 ('term',)]

In [7]:
%%sql

SELECT * FROM letter_grade

 * mysql://dimitri:***@db.data-science-ust.net
11 rows affected.

[('A', Decimal('4.00')),
 ('A-', Decimal('3.67')),
 ('B', Decimal('3.00')),
 ('B+', Decimal('3.33')),
 ('B-', Decimal('2.67')),
 ('C', Decimal('2.00')),
 ('C+', Decimal('2.33')),
 ('C-', Decimal('1.67')),
 ('D', Decimal('1.00')),
 ('D+', Decimal('1.33')),
 ('F', Decimal('0.00'))]